import React from 'react';

const AboutContent: React.FC = () => {
    return (
        <div style={{ textAlign: 'center', marginTop: '20px' }}>
            <div>
                <h2 style={{ color: '#008080' }}>విశేషాలు</h2>
                <p style={{ color: '#b107b0', fontWeight: 'bold' }}>పోచంపల్లి చేనేత కళాకారులు నిలువు పేకల మగ్గంపై నేసిన చేనేత కళాఖండాలకు ప్రపంచ వ్యాప్తంగా మంచి గుర్తింపు ఉంది. తెలంగాణ రాష్ట్ర రాజధానికి 35 కి.మీ. దూరంలో ఉన్న పోచంపల్లి చేనేత, భూదానోద్యమానికి ప్రసిద్ధి చెందింది. అక్కడి చేనేత కార్మికులు నేసిన చీరలు అందరినీ మురిపిస్తాయి. ఇక ఆడవారినైతే అమితంగా ఆకర్షిస్తాయి. చేనేతల్లో మొదటగా పేటెంట్ హక్కు పొందడం ఓ ప్రత్యేకత. సాధారణ స్త్రీల నుండి దేశ విదేశీ వనితల వరకూ అందరినీ ఆకట్టుకునే చేనేత ఉత్పత్తులు, చీరలతో ఖండాంతర ఖ్యాతిని పోచంపల్లి పొందింది. అనాడు అగ్గిపెట్టెలో పట్టే పట్టుచీరను నేసిన నేతన్నలు ప్రస్తుతం అనేక డిజైన్లలో చేనేత బట్టలను నేసి, అందరినీ ఆకర్షిస్తున్నారు</p>
                <h2 style={{ color: '#008080', fontWeight: 'bold' }}>చరిత్ర</h2>
                <p style={{ color: '#b107b0', fontWeight: 'bold' }}>పోచంపల్లిలో మొదట నూలు చీరలు మాత్రమే నేసేవారు. 1970 నుంచి పట్టు చీరల తయారీ ప్రారంభమైంది. అప్పటి పంచాయితీ పెద్దలు కొందరు, బతుకుతెరువు మరింత మెరుగుపరచుకోవడానికి నూలుతో పాటు పట్టు కూడా నేయాలని నిర్ణయించారు. ఇద్దరు యువకులను బెంగుళూరు పంపి నేతలో మెలకువలు తెలుసుకోమన్నారు. అదే పోచంపల్లి చేతిమగ్గాల పరిశ్రమకి ఒక పెద్ద ఆరంభం. ఈ చీరలు ఆధునికంగా ఉంటాయి. ఈ చీరల తయారీ "ఇక్కత్" మీద ఆధారపడుతుంది. ఈ పనితనం "చీరాల" నుండి ఈ ప్రాంతానికి వచ్చింది. పోచంపల్లి వార్ప్ ఇక్కత్ తో మొదలుపెట్టి డబల్ ఇక్కత్ మీద పనిచేయడం మొదలు పెట్టారు. నూలుతో చేసిన ప్రయోగం విజయవంతం అవడంలో అది పట్టు మీద కూడా చేపట్టారు</p>
                <h2 style={{ color: '#008080' }}>ఇక్కత్ నేత</h2>
                <p style={{ color: '#b107b0', fontWeight: 'bold' }}>గుజరాత్, ఒరిస్సా రాష్ట్రాలలో వలె ఇక్కాత్ నేతకు తెలంగాణ రాష్ట్రంలోని ఈ ప్రాంతం ప్రసిద్ధమైంది.పోచంపల్లి ఇక్కత్ నేతలో టైయింగ్, ఇంకా డైయింగ్ అనే ప్రక్రియలో 18 అంకాలుంటాయి. నేసే ముందు బండిళ్లకొద్దీ దారానికి రంగులద్దుతారు. పోచంపల్లి నేతలో ఉండే ప్రత్యేకత ఏంటంటే, వార్ప్, ఇంకా వెఫ్ట్ మీదకు పోచంపల్లి డిజైన్ను దింపుతారు. నేయబోయే బట్ట డిజైన్ రంగు అద్దిన దారాల్లో కనిపిస్తుంది. ముందుగా ముడి పట్టును డీగమ్ చేస్తారు అంటే అందులో ఉన్న పట్టుపురుగులు వదిలే సెరిసిన్ అనే ఒక మాంసకృత్తిని పట్టు నుంచి తీసేస్తారు. అలా దాన్నుంచి ఆ జిగురు తీసేయడం వలన పట్టుకు మెరుపు వస్తుంది. రంగు మెరుగుపడుతుంది. తర్వాత పట్టును కండెల నుంచి బాబిన్లకు ఎక్కిస్తారు. కళాకారుడి నైపుణ్యం చూడాలంటే కండెల నుంచి బాబిన్లకు పట్టును ఎక్కించేటప్పుడు చూడాలి. బాబిన్లకు చుట్టిన తర్వాత అంకం టై అండ్ టై ఫ్రేమ్ మీద వార్ప్ అండ్ వెఫ్ట్ను సిద్ధం చేసుకోవడం. ఇక్కత్ ఒకరకమైన నేత. దాంట్లో వార్ప్, వెఫ్న్టు చీర మీద డిజైన తయారు చేసి నేయడానికి ముందు టై అండ్ డై చేస్తారు. ముందుగా పట్టును బ్లీచింగ్ చేసి ఆరబెడతారు. చిక్కులుగా ఉన్న పట్టుదారాల నుంచి ఒక్కో పోగును తీసుకని రాట్నంపై వడుకుతారు. అలా వడికిన పట్టను మొత్తం కండెలకు చుడతారు. కండెల నుంచి దారమంతా ఆసు పోస్తారు. ఎంపిక చేసుకున్న డిజైన్ ను ఆసుపై పోస్తారు. చిటికి ద్వారా డిజైన్ చేస్తూ రబ్బరుతో ముళ్లు వేసి కావలసిన రంగులు అద్దుతూ.. అందమైన వస్త్రాలను నేస్తారు. 1953 లో తొలిసారిగా పోచంపల్లిలో తొలిసారిగా ఇక్కత్ కళ మొదలైంది. కర్నాటి అనంతరాములు అనే పెద్దాయన గుజరాత్ లోని బెనారస్ వెళ్లి శిక్షణ తీసుకుని సిల్క్ తో ఇక్కత్ కళను వెలుగులోకి తెచ్చాడు. ఇక్కత్ కళకు 2003 లో భారత ప్రభుత్వం నుంచి పేటెంట్ హక్కులు లభించాయి.

                    ఇక్కడ ఉత్పత్తయ్యే చేనేత చీరలు 2 వేల రూపాయల నుంచి యాభై, అరవై వేల రూపాయల వరకు ధర పలుకుతాయంటే నమ్మశక్యంగా ఉండదు. తెలుగు, హిందీ చిత్ర పరిశ్రమల ప్రముఖ సినీతారలు, అనేక రాజకీయ నాయకులు, ఇతర దేశాల నుంచి విచ్చేసిన మహిళలు సైతం పోచంపల్లి చేనేత కార్మికులు తయారుచేసిన చీరలవైపు మక్కువ చూపడం విశేషం.</p>
            </div>
        </div>
    );
};

export default AboutContent;

